# For psychometric

In [1]:
from Modules import modules as md
from Modules import usermodules as um
import pandas as pd

In [2]:
df = md.ReadDataset('r4.2/psychometric')

In [3]:
display(df.shape)
display(df.head())
display(df.tail())

(1000, 7)

             employee_name  user_id   O   C   E   A   N
0         Calvin Edan Love  CEL0561  40  39  36  19  40
1  Christine Reagan Deleon  CRD0624  26  22  17  39  32
2    Jade Felicia Caldwell  JFC0557  22  16  23  40  33
3   Aquila Stewart Dejesus  ASD0577  40  48  36  14  37
4        Micah Abdul Rojas  MAR0955  36  44  23  44  25

               employee_name  user_id   O   C   E   A   N
995        Dylan Tiger Terry  DTT0076  42  16  34  24  28
996      Price Rashad Mullen  PRM0740  45  40  45  42  27
997  Florence Gloria Whitney  FGW0853  25  35  20  40  39
998  Judith Shaeleigh Hayden  JSH0330  20  16  23  24  28
999      Ferris Stone Bender  FSB0399  23  22  15  37  26

In [4]:
df1 = df.copy()

In [5]:
del df1['O']
del df1['C']
del df1['E']
del df1['A']
del df1['N']

In [8]:
um.exportFile(df1,'psychometric')

Exporting psychometric_copy.csv is Done !

# Verify

In [9]:
from Modules import modules as md
from Modules import usermodules as um
import pandas as pd

In [10]:
df1 = md.ReadDataset('psychometric_copy')

In [11]:
df1.head()

             employee_name  user_id
0         Calvin Edan Love  CEL0561
1  Christine Reagan Deleon  CRD0624
2    Jade Felicia Caldwell  JFC0557
3   Aquila Stewart Dejesus  ASD0577
4        Micah Abdul Rojas  MAR0955